---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromScaledLink
source: html/72f3ad79-9bcd-4d60-b565-2e2f2c54b84e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromScaledLink Property

Can't acquire coordinates from a link that is scaled.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAcquireCoordinatesFromScaledLink { get; }
```